# Дана последовательность из N целых чисел и число K.
# Необходимо сдвинуть всю последовательность (сдвиг - циклический) на K элементов вправо, 
# K – положительное число.

import random
my_list = [i for i in range(20)]
print(my_list)
k = 5
# for i in range(k):
#     item = my_list.pop(len(my_list) -1)
#     my_list.insert(0, item)

# print(my_list[-k:] + my_list[:-k])
