# Задача 2: Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

digit = int(input('Введите трехзначное число  > '))
if (digit < 1000 and digit > 99):
    print(f'{digit} -> {digit // 100 + digit % 100 // 10 + digit % 10} ({digit // 100} + {digit % 100 // 10} + {digit % 10})')
else: 
    print('Введено не трезначное число')  